import "./partners.scss";

const Partners = () => {
  return (
    <section className="partners">
      <div className="path flex flex-center">
        <div className="main">Головна</div>
        <div className="dot"></div>
        <div className="current">Партнери</div>
      </div>
      <h2 className="title">Партнери</h2>
      <div className="partners_container">
        <div className="item">
          <div className="item_top">
            <img src="./images/partners1.png" alt="partner" />
            <h3>
              ТОВ МП "Майбутнє
              <br />
              Будуємо Разом"
            </h3>
          </div>
          <p>
            «Компанія ТОВ “ДАМАР АГРОТРЕЙД” — молода команда, яка з’явилась на
            аграрному ринку у 2020 році. Ми не боїмось труднощів і викликів.
            Тому навіть складний ковідний період, світова пандемія не стали на
            заваді успішному старту. Отже, ми — сміливі, ми — драйвові, ми — ті,
            що розвивають рослинництво та допомагають ставати успішними тисячам
            вітчизняних аграріїв.
          </p>
        </div>
        <div className="item">
          <div className="item_top">
            <img src="./images/partners2.png" alt="partner" />
            <h3>
              ТОВ МП "Майбутнє
              <br /> Будуємо Разом"
            </h3>
          </div>
          <p>
            «Компанія ТОВ “ДАМАР АГРОТРЕЙД” — молода команда, яка з’явилась на
            аграрному ринку у 2020 році. Ми не боїмось труднощів і викликів.
            Тому навіть складний ковідний період, світова пандемія не стали на
            заваді успішному старту. Отже, ми — сміливі, ми — драйвові, ми — ті,
            що розвивають рослинництво та допомагають ставати успішними тисячам
            вітчизняних аграріїв.
          </p>
        </div>
        <div className="item">
          <div className="item_top">
            <img src="./images/partners3.png" alt="partner" />
            <h3>
              ТОВ МП "Майбутнє
              <br /> Будуємо Разом"
            </h3>
          </div>
          <p>
            «Компанія ТОВ “ДАМАР АГРОТРЕЙД” — молода команда, яка з’явилась на
            аграрному ринку у 2020 році. Ми не боїмось труднощів і викликів.
            Тому навіть складний ковідний період, світова пандемія не стали на
            заваді успішному старту. Отже, ми — сміливі, ми — драйвові, ми — ті,
            що розвивають рослинництво та допомагають ставати успішними тисячам
            вітчизняних аграріїв.
          </p>
        </div>
        <div className="item">
          <div className="item_top">
            <img src="./images/partners4.png" alt="partner" />
            <h3>
              ТОВ МП "Майбутнє
              <br /> Будуємо Разом"
            </h3>
          </div>
          <p>
            «Компанія ТОВ “ДАМАР АГРОТРЕЙД” — молода команда, яка з’явилась на
            аграрному ринку у 2020 році. Ми не боїмось труднощів і викликів.
            Тому навіть складний ковідний період, світова пандемія не стали на
            заваді успішному старту. Отже, ми — сміливі, ми — драйвові, ми — ті,
            що розвивають рослинництво та допомагають ставати успішними тисячам
            вітчизняних аграріїв.
          </p>
        </div>
        <div className="item">
          <div className="item_top">
            <img src="./images/partners5.png" alt="partner" />
            <h3>
              ТОВ МП "Майбутнє
              <br /> Будуємо Разом"
            </h3>
          </div>
          <p>
            «Компанія ТОВ “ДАМАР АГРОТРЕЙД” — молода команда, яка з’явилась на
            аграрному ринку у 2020 році. Ми не боїмось труднощів і викликів.
            Тому навіть складний ковідний період, світова пандемія не стали на
            заваді успішному старту. Отже, ми — сміливі, ми — драйвові, ми — ті,
            що розвивають рослинництво та допомагають ставати успішними тисячам
            вітчизняних аграріїв.
          </p>
        </div>
        <div className="item">
          <div className="item_top">
            <img src="./images/partners6.png" alt="partner" />
            <h3>
              ТОВ МП "Майбутнє
              <br /> Будуємо Разом"
            </h3>
          </div>
          <p>
            «Компанія ТОВ “ДАМАР АГРОТРЕЙД” — молода команда, яка з’явилась на
            аграрному ринку у 2020 році. Ми не боїмось труднощів і викликів.
            Тому навіть складний ковідний період, світова пандемія не стали на
            заваді успішному старту. Отже, ми — сміливі, ми — драйвові, ми — ті,
            що розвивають рослинництво та допомагають ставати успішними тисячам
            вітчизняних аграріїв.
          </p>
        </div>
        <div className="item">
          <div className="item_top">
            <img src="./images/partners7.png" alt="partner" />
            <h3>
              ТОВ МП "Майбутнє
              <br /> Будуємо Разом"
            </h3>
          </div>
          <p>
            «Компанія ТОВ “ДАМАР АГРОТРЕЙД” — молода команда, яка з’явилась на
            аграрному ринку у 2020 році. Ми не боїмось труднощів і викликів.
            Тому навіть складний ковідний період, світова пандемія не стали на
            заваді успішному старту. Отже, ми — сміливі, ми — драйвові, ми — ті,
            що розвивають рослинництво та допомагають ставати успішними тисячам
            вітчизняних аграріїв.
          </p>
        </div>
        <div className="item">
          <div className="item_top">
            <img src="./images/partners1.png" alt="partner" />
            <h3>
              ТОВ МП "Майбутнє
              <br /> Будуємо Разом"
            </h3>
          </div>
          <p>
            «Компанія ТОВ “ДАМАР АГРОТРЕЙД” — молода команда, яка з’явилась на
            аграрному ринку у 2020 році. Ми не боїмось труднощів і викликів.
            Тому навіть складний ковідний період, світова пандемія не стали на
            заваді успішному старту. Отже, ми — сміливі, ми — драйвові, ми — ті,
            що розвивають рослинництво та допомагають ставати успішними тисячам
            вітчизняних аграріїв.
          </p>
        </div>
      </div>
    </section>
  );
};

export default Partners;
